&НаКлиенте
Процедура ПечатьНакладной(Команда)

    ТабДокумент = СформироватьПечатнуюФормуНаСервере();
    ТабДокумент.Показать();

КонецПроцедуры
&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()

    ДокументОбъект = РеквизитФормыВЗначение("Объект");

    Макет = Документы.Реализация.ПолучитьМакет("ПечатнаяФорма");
    ТабДокумент = Новый ТабличныйДокумент;

    // Заголовок
    Область = Макет.ПолучитьОбласть("Заголовок");
    Область.Параметры.Номер = ДокументОбъект.Номер;
    Область.Параметры.Дата = ДокументОбъект.Дата;
    Область.Параметры.Контрагент = ДокументОбъект.Контрагент;
    ТабДокумент.Вывести(Область);

    // Шапка таблицы
    Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
    ТабДокумент.Вывести(Область);

    // Товары
    Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл

        Область = Макет.ПолучитьОбласть("СтрокаТовара");
		Область.Параметры.Заполнить(СтрокаТоваров);
		
		Область.Параметры.Товар = Строка(СтрокаТоваров.Товар);

        ТабДокумент.Вывести(Область);

    КонецЦикла;

    // Итог
    Область = Макет.ПолучитьОбласть("Итог");
    Область.Параметры.ИтогоСумма =
        ДокументОбъект.Товары.Итог("Сумма");

    ТабДокумент.Вывести(Область);

    Возврат ТабДокумент;

КонецФункции