#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого Строка Из Товары Цикл
		Строка.Сумма = Строка.Цена * Строка.Количество;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого Строка Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Строка.Товар;
		Движение.Количество = Строка.Количество;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти